Repository: skenderl/Flutter-LiteMorseTrainer
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr

# title
source: Learn Morse Code
de: Lerne Morsecode
es: Aprenda el código Morse
fr: Apprenez le code Morse

source: Start
es: Comienzo
fr: Commencer

# lettersTutorial
source: Letters
de: Briefe
es: Letras
fr: Lettres

# numbersTutorial
source: Numbers
de: Zahlen
es: Números
fr: Nombres

# categoryTitle
source: Select Mode:
de: Auswahlmodus:
es: Seleccionar modo:
fr: Sélectionnez le mode:

# easyCategory
source: Easy
de: Einfach
es: Fácil
fr: Facile

# mediumCategory
source: Medium
de: Mittel
es: Medio
fr: Moyen

# hardCategory
source: Hard
de: Schwer
es: Difícil
fr: Dur

# share
source: Check out our apps: {link}
de: Schauen Sie sich unsere Apps an: {link}
es: Mira nuestras aplicaciones: {link}
fr: Découvrez nos applications: {link}

source: Settings
de: Einstellungen
es: Configuraciones
fr: Paramètres

source: Silent Mode
de: Lies Modus
es: Modo silencioso
fr: Mode Silencieux

source: Vibration
es: Vibración

source: Keyboard Input Timeout
de: Zeitlimit für Tastatureingabe
es: Tiempo de espera de entrada del teclado
fr: Délai d'entrée au clavier

# keyboardInputTimeoutValue
source: {value} sec
de: {value} sek
es: {value} seg

# secretFnc
source: Secret Function
de: Geheime Funktion
es: Función secreta
fr: Fonction secrète

# secretFncDesc
source: Not really ...
de: Nicht wirklich ...
es: Realmente no ...
fr: Pas vraiment ...

source: Need Help?
de: Brauchen Sie Hilfe?
es: ¿Necesitas ayuda?
fr: Besoin d'aide?

source: Answer:
de: Antworten:
es: Respuesta:
fr: Réponse:

# rule
source: Rule {number} :
de: Regel {number} :
es: Regla {number} :
fr: Règle {number} :

source: Code / Decode
de: Code / Decodieren
es: Codificar / Decodificar
fr: Codage / Décodage

# txtToMorse
source: String to Morse:
de: String zu Morse:
es: Stringo a Morse:
fr: Stringe en morse:

# typeYourTxt
source: Type your String
de: Tippe deinen String
es: Escribe tu Stringo
fr: Tapez votre Stringe

source: Copy Morse
de: Kopieren Sie Morse
es: Copiar Morse
fr: Copier Morse

source: Play Morse
de: Spielen Sie Morse
es: Jugar Morse
fr: Jouez le Morse

source: Morse Code Rules:
de: Morsecode-Regeln:
es: Reglas del código Morse:
fr: Règles du code Morse:

# rule1
source: The length of a dot is one unit.
de: Die Länge eines Punktes beträgt eine Einheit.
es: La longitud de un punto es una unidad.
fr: La longueur d'un point est d'une unité.

# rule2
source: A dash is three units.
de: Ein Bindestrich besteht aus drei Einheiten.
es: Un guión son tres unidades.
fr: Un tiret correspond à trois unités.

# rule3
source: The space between symbols (dots and dashes) of the same letter is one unit.
de: Der Abstand zwischen Symbolen (Punkten und Strichen) desselben Buchstabens beträgt eine Einheit.
es: El espacio entre símbolos (puntos y guiones) de la misma letra es una unidad.
fr: L'espace entre les symboles (points et tirets) d'une même lettre est d'une unité.

# rule4
source: The space between letters is three units.
de: Der Abstand zwischen den Buchstaben beträgt drei Einheiten.
es: El espacio entre letras es de tres unidades.
fr: L'espace entre les lettres est de trois unités.

# rule5
source: The space between words is seven units.
de: Der Abstand zwischen den Wörtern beträgt sieben Einheiten.
es: El espacio entre palabras es de siete unidades.
fr: L'espace entre les mots est de sept unités.

# alphabet
source: ABCDEFGHIJKLMNOPQRSTUVWXYZ
de: ABCDEFGHIJKLMNOPQRSTUVWXYZÄÖÜß
es: ABCDEFGHIJKLMNOPQRSTUVWXYZÁÉÍÓÚÜÑ
fr: ABCDEFGHIJKLMNOPQRSTUVWXYZÇÜÂÀÊËÈÎÉÆÔÛÙ

source: Single Key Keyboard
de: Einzeltastatur
es: Teclado de una sola tecla
fr: Clavier à une seule touche

source: Double Key Keyboard
de: Doppeltastatur
es: Teclado de doble tecla
fr: Clavier à deux touches

source: System Language
de: Systemsprache
es: Lenguaje del sistema
fr: Langue système

source: Tutorial
de: Lernprogramm
fr: Tutoriel
